In [39]:
#Employee salary prediction using a csv file called adult
#loading libraries
import pandas as pd

In [40]:
#loading dataset
data = pd.read_csv('adult.csv')
df=pd.DataFrame(data)
# Keep the original data in 'data' and use 'df' for modifications

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        48842 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  object
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  object
 6   occupation       48842 non-null  object
 7   relationship     48842 non-null  object
 8   race             48842 non-null  object
 9   gender           48842 non-null  object
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   48842 non-null  object
 14  income           48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

In [42]:
categorical_fea=df.select_dtypes(include=['object'])
for i in categorical_fea:
  print(df[i].value_counts())
  print("-------")

workclass
Private             33906
Self-emp-not-inc     3862
Local-gov            3136
?                    2799
State-gov            1981
Self-emp-inc         1695
Federal-gov          1432
Without-pay            21
Never-worked           10
Name: count, dtype: int64
-------
education
HS-grad         15784
Some-college    10878
Bachelors        8025
Masters          2657
Assoc-voc        2061
11th             1812
Assoc-acdm       1601
10th             1389
7th-8th           955
Prof-school       834
9th               756
12th              657
Doctorate         594
5th-6th           509
1st-4th           247
Preschool          83
Name: count, dtype: int64
-------
marital-status
Married-civ-spouse       22379
Never-married            16117
Divorced                  6633
Separated                 1530
Widowed                   1518
Married-spouse-absent      628
Married-AF-spouse           37
Name: count, dtype: int64
-------
occupation
Prof-specialty       6172
Craft-repair         6112
Exec-managerial      6086
Adm-clerical         5611
Sales                5504
Other-service        4923
Machine-op-inspct    3022
?                    2809
Transport-moving     2355
Handlers-cleaners    2072
Farming-fishing      1490
Tech-support         1446
Protective-serv       983
Priv-house-serv       242
Armed-Forces           15
Name: count, dtype: int64
-------
relationship
Husband           19716
Not-in-family     12583
Own-child          7581
Unmarried          5125
Wife               2331
Other-relative     1506
Name: count, dtype: int64
-------
race
White                 41762
Black                  4685
Asian-Pac-Islander     1519
Amer-Indian-Eskimo      470
Other                   406
Name: count, dtype: int64
-------
gender
Male      32650
Female    16192
Name: count, dtype: int64
-------
native-country
United-States                 43832
Mexico                          951
?                               857
Philippines                     295
Germany                         206
Puerto-Rico                     184
Canada                          182
El-Salvador                     155
India                           151
Cuba                            138
England                         127
China                           122
South                           115
Jamaica                         106
Italy                           105
Dominican-Republic              103
Japan                            92
Guatemala                        88
Poland                           87
Vietnam                          86
Columbia                         85
Haiti                            75
Portugal                         67
Taiwan                           65
Iran                             59
Nicaragua                        49
Greece                           49
Peru                             46
Ecuador                          45
France                           38
Ireland                          37
Thailand                         30
Hong                             30
Cambodia                         28
Trinadad&Tobago                  27
Laos                             23
Outlying-US(Guam-USVI-etc)       23
Yugoslavia                       23
Scotland                         21
Honduras                         20
Hungary                          19
Holand-Netherlands                1
Name: count, dtype: int64
-------
income
<=50K    37155
>50K     11687
Name: count, dtype: int64
-------

In [43]:
# Drop columns 'race' and 'relationship'
df.drop(columns=['race','relationship'], inplace=True)

In [44]:
# remove duplicate rows
df.drop_duplicates(inplace=True)

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 48778 entries, 0 to 48841
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48778 non-null  int64
 1   workclass        48778 non-null  object
 2   fnlwgt           48778 non-null  int64
 3   education        48778 non-null  object
 4   educational-num  48778 non-null  int64
 5   marital-status   48778 non-null  object
 6   occupation       48778 non-null  object
 7   gender           48778 non-null  object
 8   capital-gain     48778 non-null  int64
 9   capital-loss     48778 non-null  int64
 10  hours-per-week   48778 non-null  int64
 11  native-country   48778 non-null  object
 12  income           48778 non-null  object
dtypes: int64(6), object(7)
memory usage: 5.2+ MB

In [46]:
df[['education','educational-num']].value_counts()

education     educational-num
HS-grad       9                  15763
Some-college  10                 10859
Bachelors     13                  8012
Masters       14                  2656
Assoc-voc     11                  2060
11th          7                   1812
Assoc-acdm    12                  1601
10th          6                   1389
7th-8th       4                    954
Prof-school   15                   834
9th           5                    756
12th          8                    655
Doctorate     16                   594
5th-6th       3                    507
1st-4th       2                    245
Preschool     1                     81
Name: count, dtype: int64

In [47]:
df= df[df['educational-num'] >= 12]
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 13697 entries, 2 to 48837
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              13697 non-null  int64
 1   workclass        13697 non-null  object
 2   fnlwgt           13697 non-null  int64
 3   education        13697 non-null  object
 4   educational-num  13697 non-null  int64
 5   marital-status   13697 non-null  object
 6   occupation       13697 non-null  object
 7   gender           13697 non-null  object
 8   capital-gain     13697 non-null  int64
 9   capital-loss     13697 non-null  int64
 10  hours-per-week   13697 non-null  int64
 11  native-country   13697 non-null  object
 12  income           13697 non-null  object
dtypes: int64(6), object(7)
memory usage: 1.5+ MB

In [48]:
df.drop(columns=['education'], inplace=True)

## Data Cleaning

In [49]:
df['workclass'].replace('?', 'unknow', inplace=True)
df['occupation'].replace('?', 'unknow', inplace=True)
df['native-country'].replace('?', 'unknow', inplace=True)

C:\Users\VIJAY\AppData\Local\Temp\ipykernel_32364\2158455904.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['workclass'].replace('?', 'unknow', inplace=True)
C:\Users\VIJAY\AppData\Local\Temp\ipykernel_32364\2158455904.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['occupation'].replace('?', 'unknow', inplace=True)
C:\Users\VIJAY\AppData\Local\Temp\ipykernel_32364\2158455904.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['native-country'].replace('?', 'unknow', inplace=True)

In [50]:
categorical_fea=df.select_dtypes(include=['object'])
for i in categorical_fea:
  print(df[i].value_counts())
  print("-------")

workclass
Private             8375
Local-gov           1431
Self-emp-not-inc    1197
State-gov            923
Self-emp-inc         772
Federal-gov          564
unknow               433
Without-pay            2
Name: count, dtype: int64

-------
marital-status
Married-civ-spouse       7356
Never-married            4064
Divorced                 1620
Widowed                   244
Separated                 243
Married-spouse-absent     160
Married-AF-spouse          10
Name: count, dtype: int64
-------
occupation
Prof-specialty       4855
Exec-managerial      3193
Sales                1721
Adm-clerical         1167
Craft-repair          544
Tech-support          541
unknow                433
Other-service         413
Protective-serv       219
Machine-op-inspct     164
Farming-fishing       160
Transport-moving      148
Handlers-cleaners     118
Priv-house-serv        17
Armed-Forces            4
Name: count, dtype: int64
-------
gender
Male      9507
Female    4190
Name: count, dtype: int64
-------
native-country
United-States                 12194
unknow                          368
Philippines                     141
India                           110
Germany                          80
China                            69
Canada                           67
England                          62
Mexico                           56
Taiwan                           54
Japan                            46
South                            44
Cuba                             40
Iran                             38
Italy                            27
Poland                           25
Jamaica                          24
France                           24
Vietnam                          22
Puerto-Rico                      21
El-Salvador                      17
Columbia                         16
Hong                             15
Thailand                         13
Peru                             12
Haiti                            12
Greece                           11
Ireland                          10
Dominican-Republic               10
Hungary                           9
Ecuador                           8
Nicaragua                         8
Scotland                          7
Outlying-US(Guam-USVI-etc)        6
Yugoslavia                        6
Cambodia                          5
Laos                              5
Trinadad&Tobago                   4
Guatemala                         4
Portugal                          4
Honduras                          3
Name: count, dtype: int64
-------
income
<=50K    7466
>50K     6231
Name: count, dtype: int64
-------

In [51]:
df.drop(columns=['capital-gain','capital-loss','fnlwgt','marital-status'], inplace=True)

In [52]:
# convert the target feature to 0 and 1
df['income'].replace({'<=50K': 0, '>50K': 1}, inplace=True)

C:\Users\VIJAY\AppData\Local\Temp\ipykernel_32364\3247117567.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['income'].replace({'<=50K': 0, '>50K': 1}, inplace=True)
C:\Users\VIJAY\AppData\Local\Temp\ipykernel_32364\3247117567.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['income'].replace({'<=50K': 0, '>50K': 1}, inplace=True)

In [53]:
df.head()

,age,workclass,educational-num,occupation,gender,hours-per-week,native-country,income
2,28,Local-gov,12,Protective-serv,Male,40,United-States,1
7,63,Self-emp-not-inc,15,Prof-specialty,Male,32,United-States,1
11,36,Federal-gov,13,Adm-clerical,Male,40,United-States,0
15,43,Private,14,Exec-managerial,Male,50,United-States,1
19,40,Private,16,Prof-specialty,Male,45,unknow,1

In [54]:
df['gender'].replace({'Male': 0, 'Female': 1}, inplace=True)

C:\Users\VIJAY\AppData\Local\Temp\ipykernel_32364\2191433034.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['gender'].replace({'Male': 0, 'Female': 1}, inplace=True)
C:\Users\VIJAY\AppData\Local\Temp\ipykernel_32364\2191433034.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['gender'].replace({'Male': 0, 'Female': 1}, inplace=True)

In [55]:
categorical_fea=df.select_dtypes(include=['object'])
for i in categorical_fea:
  print(df[i].value_counts())
  print("-------")
  print(len(df[i].value_counts()))

workclass
Private             8375
Local-gov           1431
Self-emp-not-inc    1197
State-gov            923
Self-emp-inc         772
Federal-gov          564
unknow               433
Without-pay            2
Name: count, dtype: int64
-------
8
occupation
Prof-specialty       4855
Exec-managerial      3193
Sales                1721
Adm-clerical         1167
Craft-repair          544
Tech-support          541
unknow                433
Other-service         413
Protective-serv       219
Machine-op-inspct     164
Farming-fishing       160
Transport-moving      148
Handlers-cleaners     118
Priv-house-serv        17
Armed-Forces            4
Name: count, dtype: int64
-------
15
native-country
United-States                 12194
unknow                          368
Philippines                     141
India                           110
Germany                          80
China                            69
Canada                           67
England                          62
Mexico                           56
Taiwan                           54
Japan                            46
South                            44
Cuba                             40
Iran                             38
Italy                            27
Poland                           25
Jamaica                          24
France                           24
Vietnam                          22
Puerto-Rico                      21
El-Salvador                      17
Columbia                         16
Hong                             15
Thailand                         13
Peru                             12
Haiti                            12
Greece                           11
Ireland                          10
Dominican-Republic               10
Hungary                           9
Ecuador                           8
Nicaragua                         8
Scotland                          7
Outlying-US(Guam-USVI-etc)        6
Yugoslavia                        6
Cambodia                          5
Laos                              5
Trinadad&Tobago                   4
Guatemala                         4
Portugal                          4
Honduras                          3
Name: count, dtype: int64
-------
41

In [56]:
# For occupation
occupation_counts =df['occupation'].value_counts()
rare_occupations = occupation_counts[occupation_counts < 50].index  # threshold = 50
df['occupation'] = df['occupation'].replace(rare_occupations, 'Other')
df['occupation'] = df['occupation'].replace('unknow', 'Other')

# For native-country
country_counts = df['native-country'].value_counts()
rare_countries = country_counts[country_counts < 50].index
df['native-country'] = df['native-country'].replace(rare_countries, 'Other')
df['native-country'] = df['native-country'].replace('unknow', 'Other')

In [57]:
df.head()

,age,workclass,educational-num,occupation,gender,hours-per-week,native-country,income
2,28,Local-gov,12,Protective-serv,0,40,United-States,1
7,63,Self-emp-not-inc,15,Prof-specialty,0,32,United-States,1
11,36,Federal-gov,13,Adm-clerical,0,40,United-States,0
15,43,Private,14,Exec-managerial,0,50,United-States,1
19,40,Private,16,Prof-specialty,0,45,Other,1

In [58]:
categorical_fea=df.select_dtypes(include=['object'])
for i in categorical_fea:
  print(df[i].value_counts())
  print("-------")
  print(len(df[i].value_counts()))

workclass
Private             8375
Local-gov           1431
Self-emp-not-inc    1197
State-gov            923
Self-emp-inc         772
Federal-gov          564
unknow               433
Without-pay            2
Name: count, dtype: int64
-------
8
occupation
Prof-specialty       4855
Exec-managerial      3193
Sales                1721
Adm-clerical         1167
Craft-repair          544
Tech-support          541
Other                 454
Other-service         413
Protective-serv       219
Machine-op-inspct     164
Farming-fishing       160
Transport-moving      148
Handlers-cleaners     118
Name: count, dtype: int64
-------
13
native-country
United-States    12194
Other              864
Philippines        141
India              110
Germany             80
China               69
Canada              67
England             62
Mexico              56
Taiwan              54
Name: count, dtype: int64
-------
10

In [59]:
!pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\users\vijay\.conda\envs\retail_st\lib\site-packages (1.7.1)
Requirement already satisfied: numpy>=1.22.0 in c:\users\vijay\.conda\envs\retail_st\lib\site-packages (from scikit-learn) (2.2.2)
Requirement already satisfied: scipy>=1.8.0 in c:\users\vijay\.conda\envs\retail_st\lib\site-packages (from scikit-learn) (1.16.0)
Requirement already satisfied: joblib>=1.2.0 in c:\users\vijay\.conda\envs\retail_st\lib\site-packages (from scikit-learn) (1.5.1)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\users\vijay\.conda\envs\retail_st\lib\site-packages (from scikit-learn) (3.6.0)

In [60]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder
import pickle

# Sample input DataFrame (assuming it's already loaded and cleaned)
# df = pd.read_csv(...) or created elsewhere

# Define the categorical columns
cat_cols = ['occupation', 'native-country', 'workclass']

# Initialize the OneHotEncoder
encoder = OneHotEncoder(drop='first', handle_unknown='ignore', sparse_output=False)

# Fit and transform the categorical data
# Fit after cleaning the data
encoder.fit(df[cat_cols])
encoded_array = encoder.transform(df[cat_cols])


# Convert encoded array to DataFrame
encoded_df = pd.DataFrame(encoded_array, columns=encoder.get_feature_names_out(cat_cols), index=df.index)

# Drop original categorical columns and concatenate encoded DataFrame
df = df.drop(columns=cat_cols)
df = pd.concat([df, encoded_df], axis=1)

# Convert all boolean columns to int
bool_cols = df.select_dtypes(include=['bool']).columns
df[bool_cols] = df[bool_cols].astype(int)

# Save the encoder to a pickle file
with open('onehot_encoder.pkl', 'wb') as f:
    pickle.dump(encoder, f)

In [61]:
df.head()

,age,educational-num,gender,hours-per-week,income,occupation_Craft-repair,occupation_Exec-managerial,occupation_Farming-fishing,occupation_Handlers-cleaners,occupation_Machine-op-inspct,...,native-country_Philippines,native-country_Taiwan,native-country_United-States,workclass_Local-gov,workclass_Private,workclass_Self-emp-inc,workclass_Self-emp-not-inc,workclass_State-gov,workclass_Without-pay,workclass_unknow
2,28,12,0,40,1,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0
7,63,15,0,32,1,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
11,36,13,0,40,0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
15,43,14,0,50,1,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
19,40,16,0,45,1,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0

In [62]:
len(df)

13697

In [63]:
df.shape

(13697, 33)

In [64]:
target = 'income'
y = df[target]
df.drop(columns=[target], inplace=True)

In [65]:
# prompt: apply the train test split ration 80 20

from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(df, y, test_size=0.2, random_state=42)

In [66]:

from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier, GradientBoostingClassifier
from sklearn.metrics import f1_score

models = {
    'Logistic Regression': LogisticRegression(max_iter=1000),
    'SVM': SVC(),
    'Decision Tree': DecisionTreeClassifier(),
    'Random Forest': RandomForestClassifier(),
    'Gradient Boosting': GradientBoostingClassifier()
}

f1_scores = {}

for name, model in models.items():
    model.fit(X_train, y_train)
    y_pred = model.predict(X_test)
    f1 = f1_score(y_test, y_pred)
    f1_scores[name] = f1
    print(f"{name} F1 Score: {f1}")

best_model_name = max(f1_scores, key=f1_scores.get)
print(f"\nBest model based on F1 score: {best_model_name}")
best_model = models[best_model_name]

c:\Users\VIJAY\.conda\envs\retail_st\Lib\site-packages\sklearn\linear_model\_logistic.py:473: ConvergenceWarning: lbfgs failed to converge after 1000 iteration(s) (status=1):
STOP: TOTAL NO. OF ITERATIONS REACHED LIMIT

Increase the number of iterations to improve the convergence (max_iter=1000).
You might also want to scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

Logistic Regression F1 Score: 0.6732348111658456
SVM F1 Score: 0.6605783866057838
Decision Tree F1 Score: 0.5990057995028998
Random Forest F1 Score: 0.6399345335515548
Gradient Boosting F1 Score: 0.6967895362663495

Best model based on F1 score: Gradient Boosting

In [ ]:
import pickle

with open(f'{best_model_name.lower().replace(" ", "_")}_model.pkl', 'wb') as f:
    pickle.dump(best_model, f)

print(f"Best model '{best_model_name}' pickled successfully.")

Best model 'Gradient Boosting' pickled successfully.